All the following data is drawn from http://totherme.org/gds.db which
contains the latest test results.


** Summing it up

   | Group                        | number |
   |------------------------------+--------|
   | All Test262                  |  11746 |
   | (Interesting) Passes         |   2229 |
   | Fails because of test bugs   |      1 |
   | Fails because of parser bugs |     16 |
   | The rest                     |   9501 |
   #+TBLFM: @6$2=@2-@3-@5


   By chapter
   
   |       Chapter | #tests | #passes | #fails/aborts | #interesting | pass+fail+abort |
   |             ! |    tst |     pss |           fls |          int |             tot |
   |---------------+--------+---------+---------------+--------------+-----------------|
   |             1 |      0 |       0 |             0 |            0 |               0 |
   |             2 |      0 |       0 |             0 |            0 |               0 |
   |             3 |      0 |       0 |             0 |            0 |               0 |
   |             4 |      0 |       0 |             0 |            0 |               0 |
   |             5 |      0 |       0 |             0 |            0 |               0 |
   |             6 |      1 |       0 |             1 |            0 |               1 |
   |             7 |    715 |     364 |           351 |          235 |             715 |
   |             8 |    182 |      97 |            85 |           79 |             182 |
   |             9 |    128 |      85 |            43 |           85 |             128 |
   |            10 |    377 |     181 |           196 |           72 |             377 |
   |            11 |   1320 |     982 |           338 |          894 |            1320 |
   |            12 |    521 |     319 |           202 |          209 |             521 |
   |            13 |    230 |     125 |           105 |          101 |             230 |
   |            14 |     24 |       7 |            17 |            5 |              24 |
   |            15 |   8075 |     757 |          7318 |          547 |            8075 |
   | best practice |     20 |       2 |            18 |            2 |              20 |
   |       intl402 |    153 |       0 |           153 |            0 |             153 |
   |---------------+--------+---------+---------------+--------------+-----------------|
   |         Total |  11746 |    2919 |          8827 |         2229 |           11746 |
   |             ^ |     tt |      pt |            ft |           it |                 |
   #+TBLFM: $tot=$pss+$fls::$ft=vsum(@3..@-1)::$it=vsum(@3..@-1)::$pt=vsum(@3..@-1)::$tt=vsum(@3..@-1)

   Number of tests in Ch06-Ch14 inclusive =
   (+ 1 715 182 128 377 1320 521 230 24) = 3498

   Number of passes in Ch06-Ch14 inclusive
   (+ 364 97 85 181 982 319 125 7) = 2160

   Number of fails/aborts in Ch06-Ch14 inclusive
   (+ 1 351 85 43 196 338 202 105 17) = 1338

   Num Interesting passes in ch06-14 inc.
   (+ 0 235 79 85 72 894 209 101 5) = 1680

   Number of tests in Ch08-Ch14 inclusive =
   (+ 182 128 377 1320 521 230 24) = 2782

   Number of passes in Ch08-Ch14 inclusive =
   (+ 97 85 181 982 319 125 7) = 1796

   | Chapter | #tests | #passes | #fails/aborts | #interesting | pass+fail+abort |
   |       ! |    tst |     pss |           fls |          int |             tot |
   |---------+--------+---------+---------------+--------------+-----------------|
   |    15.1 |    321 |      43 |           278 |           41 |             321 |
   |    15.2 |   2866 |     343 |          2523 |          309 |            2866 |
   |    15.3 |    418 |     111 |           307 |           12 |             418 |
   |    15.4 |   2319 |     139 |          2180 |          124 |            2319 |
   |    15.5 |    716 |      31 |           685 |            2 |             716 |
   |    15.6 |     34 |      26 |             8 |           18 |              34 |
   |    15.7 |    121 |      35 |            86 |           31 |             121 |
   |    15.8 |    170 |       0 |           170 |            0 |             170 |
   |    15.9 |    428 |       0 |           428 |            0 |             428 |
   |   15.10 |    544 |       0 |           544 |            0 |             544 |
   |   15.11 |     35 |      14 |            21 |           10 |              35 |
   |   15.12 |    103 |      15 |            88 |            0 |             103 |
   |   Total |   8075 |     757 |          7318 |          547 |            8075 |
   |       ^ |     tt |      pt |            ft |           it |                 |
   #+TBLFM: $6=$pss+$fls::$ft=vsum(@3..@-1)::$it=vsum(@3..@-1)::$pt=vsum(@3..@-1)::$tt=vsum(@3..@-1)


